Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.HostChangeDisallowsLoadOrBoundaryConditions
Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.

Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotPlaceBoundaryConditions
A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation.

Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMoveBoundaryCondition
Can't move Boundary Conditions

Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMirrorBoundaryCondition
Can't mirror Boundary Conditions

Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures
Failures about Load.